In [2]:
import pandas as pd
import numpy as np

In [3]:
# Create Data
stuff = {
    'Corporation': ['Apple', 'Google', 'Meta', 'Apple', 'Google', 'Meta'],
    'Employees': ['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary': [200, 220, 190, 130, 120, 150]
}

In [4]:
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [6]:
# Creates function
def times1000(x):
    return x * 1000

In [9]:
# Use apply function
my_df['Salary'].apply(times1000)

0    200000
1    220000
2    190000
3    130000
4    120000
5    150000
Name: Salary, dtype: int64

In [11]:
# Make it into a Dataframe
pd.DataFrame(my_df['Salary'].apply(times1000))

   Salary
0  200000
1  220000
2  190000
3  130000
4  120000
5  150000

In [12]:
# Namer Function
def namer(x):
    if x == 'John':
        return 'John Elder'
    else:
        return x

In [13]:
# Apply to Employees column
my_df['Employees'].apply(namer)

0    John Elder
1         April
2           Wes
3          Beth
4        Justin
5         Steph
Name: Employees, dtype: str

In [14]:
# Use Lambda instead
my_df['Salary'].apply(lambda x: x * 1000)

0    200000
1    220000
2    190000
3    130000
4    120000
5    150000
Name: Salary, dtype: int64

In [15]:
# Lambda with formatting
my_df['Salary'].apply(lambda x: f"{x * 1000:,d}")

0    200,000
1    220,000
2    190,000
3    130,000
4    120,000
5    150,000
Name: Salary, dtype: str